# coding:utf-8
"""
时间:2015/9/29
说明: 正则表达式中【】里只能是一个个字符用|分隔开来，哪怕是中文英文
"""
from cnparser import cparse


if __name__ == '__main__':
    print u'开始...'
    # s = u'九月三十日'   # -----
    # s = u'发表于 2014-12-19 14:27:55 '
    # s = u'发表于 2014-12-19 14:24'
    s = u'2015-1-21 11:52 PM'
    s = u'2015-1-21 11:52 AM'
    s = u'7/2/2015 11:05:22 PM'
    s = u'10/10/11'
    s = u'12/21/2007'
    s = u'October 23(rd), 1986'  # ----------未处理
    s = u'March 28th, 2009' # ----
    s = u'十五年前'
    s = u'十八个月前'  # 3月前
    s = u'9天前'
    s = u'十六小时前'
    s = u'22分钟前'
    s = u'50秒前'
    s = u'ttt二十秒前'
    s = u'发表于中华民国103年'
    s = u'2014-12-19 14:27:55 处理过'
    s = u'1995年6月10号下午3点41分50秒'
    s = u'1995年6 月10 号 下午 3 点41 分50 秒'
    s = u'2015/10/5 下午 07:02:53  '
    s = u' Mon Oct  5 15:03:30 2015'.replace(u'\xa0', '').strip()   # --- [u'Mon', u'Oct', u'5', u'15:03:30', u'2015']
    # s = u'2015-09-30 Wed. 23:55:20'
    print cparse(u'发表于中华民国103年')


    print u'结束...'